#+TITLE: Ejercicios del Tema 2
#+AUTHOR: Oscar Perpiñán Lamigueiro
#+DATE: 2017-2018
#+SETUPFILE: config.org
#+PROPERTY: header-args :exports code
#+EXPORT_FILE_NAME: ejercicios_tema2.pdf

* Códigos ASCII
- Escriba un programa que permita averiguar qué acrónimo está representado por los códigos ASCII:  101    116     115     105    100  105

#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  printf("El acrónimo es %c%c%c%c%c%c",
	 101, 116, 115, 105, 100, 105);
  return 0;
}
#+END_SRC

#+RESULTS:
: El acrónimo es etsidi

- Escriba un programa que imprima en pantalla las letras vocales y sus correspondientes caracteres ASCII.

#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  printf("Los códigos ASCII de las vocales son:\n");
  // Usando %d se imprime un char como entero.
  // El código \t inserta un tabulador.
  printf("a: %d\t", 'a');
  printf("e: %d\t", 'e');
  printf("i: %d\t", 'i');
  printf("o: %d\t", 'o');
  printf("u: %d\n", 'u'); 
  return 0;
}
#+END_SRC

- Desarrolle un programa que lea un carácter en minúscula y lo imprima en mayúscula. Tenga en cuenta que las letras mayúscula de la A a la Z y las minúsculas de la a a la z tienen códigos consecutivos (ver tabla ASCII).

#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  int letra, Letra;
  const int conv = 'A' - 'a'; // Diferencia entre mayuscula y minuscula
  printf("Escriba una letra minuscula:\n");
  scanf("%c", &letra);
  // Paso a mayuscula mediante la constante conv
  Letra = letra + conv;
  printf("En mayuscula es %c\n", Letra);
  return 0;
}
#+END_SRC
